       IDENTIFICATION DIVISION.
       PROGRAM-ID. DEMO.
       PROCEDURE DIVISION.
       MAIN SECTION.
       RUN.
           PERFORM HELPER.
       HELPER.
           GOBACK.
